---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.MinRange
source: html/e6cc095d-4f3e-b445-f257-015a0ad7447b.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.MinRange Property

The minimum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor.
 In the example above, the minimum range will be 1.

## Syntax (C#)
```csharp
public double MinRange { get; set; }
```